21.Воронка продаж. Бизнес-процессы и задачи/BusinessProcesses/ТестированиеКандидата.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<BusinessProcess>
		<Properties>
			<Name>ТестированиеКандидата</Name>
			<Task>Task.ЗадачиДляТестирования</Task>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФИО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрошелТестНаАдминистрирование1С</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрошелТестНаПрограммирование1С</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Вакансия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</BusinessProcess>
</MetaDataObject>

21.Воронка продаж. Бизнес-процессы и задачи/Enums/Вакансия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>Вакансия</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Оператор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Администратор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Программист</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

21.Воронка продаж. Бизнес-процессы и задачи/BusinessProcesses/ТестированиеКандидата/Ext/ObjectModule.bsl
Процедура ПрошелТестНаАдминистрирование1СПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = ПрошелТестНаАдминистрирование1С; 
КонецПроцедуры

Процедура ПрошелТестНаПрограммированиеВ1СПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = ПрошелТестНаПрограммирование1С;
КонецПроцедуры


Процедура ВакансияОператораПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	Результат = Перечисления.Вакансия.Оператор;
КонецПроцедуры


Процедура ВакансияАдминистратора1СПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	Результат = Перечисления.Вакансия.Администратор;

КонецПроцедуры


Процедура ВакансияПрограммиста1СПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	Результат = Перечисления.Вакансия.Программист;
КонецПроцедуры
